// src/data/timelineData.js (or .ts if using TypeScript)
export const timelineData = [
  {
    id: 1,
    date: "2023-01-15",
    title: "初识与欺骗",
    description:
      "我们初识，相处了两个月。本以为即将确定关系，你却突然对我冷暴力，以'八字不合'且当年不能谈恋爱为由与我断联。那段时间我非常伤心，但可笑的是，没过多久我就看到了你被拍到与其他女生恋爱的实锤。",
    imageUrl:
      "https://imgbed.alonglfb.com/file/1745933183931_moon-9428951_1280.jpg", // Optional image
  },
  {
    id: 2,
    date: "2023-03-22",
    title: "重新开始",
    description:
      "你重新联系我，表明已单身并想和我正式交往。那时我正经历感情挫折，你耐心陪伴，陪我哭，逗我笑。怕我一个人待着难过，怕我没有安全感，你选择离开从小长大的城市搬来成都。于是我决定放下之前的芥蒂，和你重新开始。",
    // No image for this one
  },
  {
    id: 3,
    date: "2023-07-01",
    title: "第一次出轨实锤",
    description:
      "我初次发现了你出轨的证据。是游戏对话框里密密麻麻的暧昧，是坐在我身边也不停发送的露骨消息。当我们对质时，你跪地痛哭向我忏悔，保证永不再犯。但你的保证真的很廉价。",
    imageUrl:
      "https://imgbed.alonglfb.com/file/1745933185565_cat-8042346_1280.jpg",
  },
  {
    id: 4,
    date: "2023-09-10",
    title: "触目惊心的177条录音",
    description:
      "某天你出差，我在你的电脑里发现了177条录音文件，全部是你跟不同女生的语音对话。备受打击的我当下没撑住，做出过激行为住了院。事后你跟我保证没有实质性出轨，给我洗脑说这就像看小电影一样。我很清楚当下自己有多受伤才会伤害自己，但在意识模糊时看到你发的道歉信又心软了。",
    imageUrl:
      "https://imgbed.alonglfb.com/file/1745933189815_dog-9534362_1280.jpg",
  },
  {
    id: 5,
    date: "2024-01-20",
    title: "无法忍受的痛苦",
    description:
      "在已经发现了你数十次的暧昧和背叛后，我再也无法忍受这样的折磨，向你提出了分手。过了一两个月后你又再次找我，说我离开后'没有家的样子'，向我承诺绝不再犯。我以为你是看到我真的离开后决心悔改，没想到还是我天真了。",
  },
  {
    id: 6,
    date: "2024-03-20",
    title: "最终分手与家暴",
    description:
      "我们最终分手，起因是我知道了你在距离我们家附近几百米的小区里养了另一个女生，时间已有长达半年之久。当我看到你的打车记录时，一切都清晰了。你使劲挤时间也要去陪你那见不得光的'纯爱'。在搬走之前某天吵架时，我忍不住说出那个小区名质问你。恼羞成怒之下你对我再次动手。我永远也忘不了那天，长达两小时的至暗时刻，我逃不掉更打不过。",
  },
  {
    id: 7,
    date: "2024-04-20",
    title: "真相大白",
    description:
      "分手后我收到了其他女生发给我的截图，是我们在一起时你跟别人的各种不堪入目的对话。还听到了很多其他人亲眼所见的你的龌龊事。这才知道我曾经每每的不安都不是你口中的'臆想'。3月7号我们正式分手，我搬离了同居的房子，你也在当天早上前往广州演出。那天早上我醒了但没有睁眼，你在我身边看了我很久。我以为你是难过，后面才知道你落地后疯狂给别人打电话约人，原来是你在坚持演完这出深情的戏。",
  },
];
